<a href="https://colab.research.google.com/github/fmuigai2036/Milk-Distributing-Company/blob/main/DS_Project_Exploratory_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Connecting our Database

In [ ]:
#We first load an sql extension. 
# 
# This extension will allow us to run SQL code in our Notebook.
# ---
#
%load_ext sql

In [ ]:
# We will then connect to an in memory SQLite database within colaboratory. 
# Something to note is that this in memory dataset will be deleted as 
# soon the dataset connection is lost, meaning when our connection to 
# the servers is disconnected then our database will cease to exist.
# ---
#  
%sql sqlite://

'Connected: @None'

## Loading our Dataset

In [ ]:
# To read our excel file from an external source into our colaboratory environment, 
# we will use the pandas library for data maninupation. 
#---
#
import pandas as pd

In [ ]:
# We load our first dataset from a excel file, 
# we then store the dataset in our in memory sqlite database.
# We first read our dataset from its source and store it in a dataframe called milk.
# From there we perform our analysis with sql.
# ---
#
milk = pd.read_excel('/content/Excelsample.xlsx') 
milk.head()

# Then store it in an SQL table of our in memory sqlite database 
# --- 
# 

# We then delete the table if it exists in our database
# ---
#
%sql DROP TABLE if EXISTS milk;

# And finally store our table in table name cities within our dataset.
# The persist command will create a table in the database to which we are connected, 
# the table name will be the same as dataframe variable.
# ---
#
%sql PERSIST milk;

# We can then check for the first five records.
# ---
#
%sql SELECT * FROM milk LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, '2019-01-01 00:00:00.000000', 'Depot 1', 'Route 1', 2639.94, 248751.0),
 (1, '2019-01-01 00:00:00.000000', 'Depot 1', 'Route 2', 3389.89, 259271.0),
 (2, '2019-01-01 00:00:00.000000', 'Depot 1', 'Route 3', 2160.94, 198180.0),
 (3, '2019-01-01 00:00:00.000000', 'Depot 1', 'Route 4', 3097.03, 283703.0),
 (4, '2019-01-01 00:00:00.000000', 'Depot 1', 'Route 5', 2438.93999999999, 220983.0)]

# Total Cost per Depot

In [ ]:
# Getting the total cost of sales per depot
%%sql
select ([Depot Name]), sum([Sales_Amount]) as Total_Sales
from milk
group by ([Depot Name])

 * sqlite://
Done.

[('Depot 1', 47279500.0),
 ('Depot 10', 23459532.0),
 ('Depot 11', 60867956.1),
 ('Depot 12', 42461208.0),
 ('Depot 13', 61596712.0),
 ('Depot 14', 6300.0),
 ('Depot 15', 65083975.5),
 ('Depot 16', 70976669.0),
 ('Depot 17', 33320397.0),
 ('Depot 2', 43577101.0),
 ('Depot 3', 35507111.8),
 ('Depot 4', 62571971.0),
 ('Depot 5', 61692907.0),
 ('Depot 6', 6599871.0),
 ('Depot 7', 47136206.6),
 ('Depot 8', 78183727.0),
 ('Depot 9', 37879053.0)]

# Highest Weight

In [ ]:
#Determining the total weight per depot
#
%%sql
select ([Depot Name]) as Depot, round(sum(Weight),2) as Weight
from milk
group by ([Depot Name])

 * sqlite://
Done.

[('Depot 1', 521127.58),
 ('Depot 10', 289527.46),
 ('Depot 11', 712084.61),
 ('Depot 12', 461319.29),
 ('Depot 13', 685653.25),
 ('Depot 14', 230.0),
 ('Depot 15', 635340.62),
 ('Depot 16', 748571.98),
 ('Depot 17', 373242.56),
 ('Depot 2', 494501.19),
 ('Depot 3', 508700.35),
 ('Depot 4', 685026.59),
 ('Depot 5', 759848.21),
 ('Depot 6', 100906.49),
 ('Depot 7', 670755.68),
 ('Depot 8', 779541.92),
 ('Depot 9', 495458.31)]

In [ ]:
#Determining the highest weight per depot
#
# Here we show 
%%sql
select ([Depot Name]) as Depot, round(max(Weight),2) as Weight
from milk
group by ([Depot Name]) 
order by 'Weight'

 * sqlite://
Done.

[('Depot 1', 5391.0),
 ('Depot 10', 4313.33),
 ('Depot 11', 6477.88),
 ('Depot 12', 3976.4),
 ('Depot 13', 8653.79),
 ('Depot 14', 230.0),
 ('Depot 15', 5080.07),
 ('Depot 16', 5192.6),
 ('Depot 17', 3304.06),
 ('Depot 2', 4755.16),
 ('Depot 3', 4831.83),
 ('Depot 4', 4542.99),
 ('Depot 5', 5891.77),
 ('Depot 6', 14082.52),
 ('Depot 7', 4342.55),
 ('Depot 8', 6893.52),
 ('Depot 9', 4507.16)]

In [ ]:
#Determining the depot with the highest weight
#
%%sql
select ([Depot Name]) as Depot, round(max(Weight),2) as Weight
from milk
group by 'Weight'

 * sqlite://
Done.

[('Depot 6', 14082.52)]

# Lowest Sales

In [ ]:
#Determining the depot with the lowest sales
#
#
%%sql
select ([Depot Name]) as Depot, round(min(Sales_Amount),2) as Total_Sales
from milk
group by ([Depot Name])

 * sqlite://
Done.

[('Depot 1', 68444.0),
 ('Depot 10', 190.0),
 ('Depot 11', 25370.0),
 ('Depot 12', 91881.0),
 ('Depot 13', 116972.0),
 ('Depot 14', 6300.0),
 ('Depot 15', 93680.0),
 ('Depot 16', 102192.0),
 ('Depot 17', 92556.0),
 ('Depot 2', 73430.0),
 ('Depot 3', 35.0),
 ('Depot 4', 91640.0),
 ('Depot 5', 25372.0),
 ('Depot 6', 47380.0),
 ('Depot 7', 210.0),
 ('Depot 8', 132403.0),
 ('Depot 9', 64667.0)]

In [ ]:
#Here we are finding out the depot with the lowest sales
%%sql
select ([Depot Name]) as Depot, round(min(Sales_Amount),2) as Total_Sales
from milk
group by 'Depot Name'

 * sqlite://
Done.

[('Depot 3', 35.0)]

# Routes in Depot 3

In [ ]:
#Determining the number of routes in Depot 3
#
%%sql
select ([Depot Name]), count([Route Name]) as Route3
from milk
where ([Depot Name]) = 'Depot 3'

 * sqlite://
Done.

[('Depot 3', 305)]